In [1]:
print("Ajay Kumar")

Ajay Kumar

In [36]:
pip install pandas

Requirement already satisfied: pandas in c:\users\kumar\appdata\local\programs\python\python39\lib\site-packages (1.4.2)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\kumar\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\kumar\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in c:\users\kumar\appdata\local\programs\python\python39\lib\site-packages (from pandas) (1.22.3)
Requirement already satisfied: six>=1.5 in c:\users\kumar\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.15.0)

In [50]:
import pandas as pd
#Dataset CSV
url = "E:/xAPI-Edu-Data.csv"
df = pd.read_csv(url)
print(df)

        name gender section  salary  year_Joining  age
0       Lois      F      H2      11          2003   60
1     Brenda      F      H2       7          2008   60
2        Joe      M      H2       8          2016   68
3      Diane      F      H1       4          1999   51
4   Benjamin      M      H2       7          2013   58
..       ...    ...     ...     ...           ...  ...
95      Jose      M      H2       7          2016   89
96    Harold      M      H2       8          2011   77
97    Nicole      F      H1       1          1989   60
98   Theresa      F      H2       8          2010   57
99     Tammy      F      H1       4          2015   55

[100 rows x 6 columns]

In [51]:
#print the dimension of dataset
df.shape

(100, 6)

In [86]:
url = "E:/xAPI-Edu-Data.csv"
df = pd.read_csv(url)
#maximum for all value in a dataset
df.max()

name            William
gender                M
section              H2
salary               12
year_Joining       2017
age                  90
dtype: object

In [87]:

#maximum for particular value in a dataset
print(df['age'].max())

90

In [88]:
#min for all value in a dataset
df.min()

name            Aaron
gender              F
section            H1
salary              1
year_Joining     1983
age                40
dtype: object

In [89]:

#min for particular value in a dataset
print(df['age'].min())

40

In [82]:

#mean for all value in a dataset
print(df.mean())

salary             6.25
year_Joining    2008.12
age               58.08
dtype: float64

C:\Users\kumar\AppData\Local\Temp\ipykernel_2300\855486343.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.mean())

In [81]:

#mean for all particular value in a dataset
print(df['age'].mean())

58.08

In [80]:

#median for all value in a dataset
df.median()

C:\Users\kumar\AppData\Local\Temp\ipykernel_2300\2703298344.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

salary             7.0
year_Joining    2010.5
age               56.0
dtype: float64

In [79]:

#median for particular value in a dataset
print(df['age'].median())

56.0

In [78]:

#mode for all value in a dataset
#This is the only central tendency measure that can be used with categorical variables, 
#unlike the mean and the median which can be used only with quantitative data.
df.mode()

    name gender section  salary  year_Joining   age
0  Nancy      F      H2       7          2016  60.0
1    NaN    NaN     NaN       8          2017   NaN

In [77]:

#median for all value in a dataset
print(df['name'].mode())

0    Nancy
Name: name, dtype: object

In [76]:

#Standard deviation for all value in a dataset
df.std()

C:\Users\kumar\AppData\Local\Temp\ipykernel_2300\2779672547.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

salary           3.453515
year_Joining     8.642484
age             12.294106
dtype: float64

In [75]:

#Standard deviation for particular value in a dataset
print(df["age"].std())

12.294106332102814

In [73]:

#Variance for all value in a dataset
df.var()

C:\Users\kumar\AppData\Local\Temp\ipykernel_2300\1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

salary           11.926768
year_Joining     74.692525
age             151.145051
dtype: float64

In [74]:

#Variance for particular value in a dataset
print(df["age"].var())

151.1450505050505

In [83]:
#function that prints the summary statistic of the numerical variables
df.describe()

           salary  year_Joining         age
count  100.000000    100.000000  100.000000
mean     6.250000   2008.120000   58.080000
std      3.453515      8.642484   12.294106
min      1.000000   1983.000000   40.000000
25%      3.000000   2003.000000   50.000000
50%      7.000000   2010.500000   56.000000
75%      8.250000   2015.000000   61.250000
max     12.000000   2017.000000   90.000000

In [52]:
url = "E:/xAPI-Edu-Data.csv"
df = pd.read_csv(url)
#Grouping and perform count over each group
df =  df.groupby('gender')['gender'].count()
print(df)

gender
F    60
M    40
Name: gender, dtype: int64

In [53]:
url = "E:/xAPI-Edu-Data.csv"
df = pd.read_csv(url)
#Grouping and perform sum over each group
df =  df.groupby('salary')['salary'].count()
print(df)

salary
1     11
2      8
3      7
4     10
5      6
6      7
7     13
8     13
9      6
10     2
11     8
12     9
Name: salary, dtype: int64

In [54]:
url = "E:/xAPI-Edu-Data.csv"
df = pd.read_csv(url)
#Group by two keys and then summarize each group
#groupby(['DEPT','GENDER'],as_index=False).SALARY.mean()
df =  df.groupby(['gender','year_Joining'],as_index=False).salary.count()
print(df)

   gender  year_Joining  salary
0       F          1983       2
1       F          1987       1
2       F          1989       1
3       F          1990       1
4       F          1991       2
5       F          1992       1
6       F          1994       2
7       F          1998       1
8       F          1999       3
9       F          2001       1
10      F          2002       1
11      F          2003       3
12      F          2004       2
13      F          2005       2
14      F          2007       2
15      F          2008       1
16      F          2009       2
17      F          2010       4
18      F          2011       1
19      F          2012       2
20      F          2013       7
21      F          2014       3
22      F          2015       5
23      F          2016       4
24      F          2017       6
25      M          1995       1
26      M          1997       2
27      M          1998       1
28      M          1999       1
29      M          2000       1
30      M          2002       1
31      M          2005       1
32      M          2006       2
33      M          2007       3
34      M          2008       1
35      M          2009       4
36      M          2011       1
37      M          2012       1
38      M          2013       1
39      M          2014       4
40      M          2015       3
41      M          2016       7
42      M          2017       5